{
    "author": ["OrchidAlloy"],
    "min_bot_version": "3.5.0",
    "description": "Designates a channel that will send automated messages mimicking your friends using Markov chains. They will have your friends' avatars and nicknames too! Inspired by /r/SubredditSimulator and similar concepts.\n\n🧠 It will learn from new messages sent in configured channels, and only from users with the configured role. Will only support a single guild.\n\n⚙ The bot owner must configure it with [p]simulator set, then they may manually feed past messages using [p]simulator feed [days]. This may take 1 minute per 5000 messages, so be patient!\n\n🔄 While the simulator is running, simulated conversations will randomly occur. Trying to type in the output channel will delete the message and trigger a conversation.\n\n👤 A user may permanently exclude themselves from their messages being read and analyzed by using the [p]dontsimulateme command. This will also delete all their data.",
    "hidden": false,
    "install_msg": "🧠 __**Simulator**__\n```Simulator cog installed. Instructions:\n1. Load it with [p]load simulator\n2. Configure an inputrole, inputchannels, and outputchannel, using [p]simulator set\n3. For testing, load 1 day of past messages with [p]simulator feed 1\n4. Start it with [p]simulator start\n5. You may trigger a simulated conversation manually by typing in the output channel.\n\n⚠ Usage Warning: This cog will store and analyze messages sent by participating users. The bot owner may also choose to let the bot download large amounts of past messages, following Discord ratelimits. It will then store a model in memory whose approximate RAM usage is 60 MB per 100,000 messages analyzed. This data will be stored locally and won't be shared anywhere outside of the target server.\n\nRead [p]simulator info for more information.```",
    "required_cogs": {},
    "requirements": ["aiosqlite"],
    "short": "Simulates messages from your friend group.",
    "end_user_data_statement": "This cog will locally store and analyze past and future messages sent by participating users, in order to generate new messages in an owner-configured output channel.\nYou may opt out completely and delete your simulator data with the [p]dontsimulateme command.",
    "tags": ["crab", "fun", "simulator", "markov", "friends"]
}
