{
    "author": ["OrchidAlloy"],
    "min_bot_version": "3.0.0",
    "description": "Designates a channel that will send automated messages mimicking your friends using Markov chains. They will have your friends' avatars and nicknames too! Inspired by /r/SubredditSimulator and similar concepts.\n\n🧠 It will learn from messages from configured channels, and only from users with the configured role. Will only support a single guild, and this is configured by the bot owner.\n\n⚙ After configuring it with [p]simulator set, you may manually feed past messages using [p]simulator feed [days]. This takes around 1 minute per 5,000 messages, so be patient! When the feeding is finished or interrupted, it will send the summary in the same channel.\n\n🔄 While the simulator is running, a conversation will occur every so many minutes, during which comments will be sent every so many seconds. Trying to type in the output channel will delete the message and trigger a conversation.\n\n👤 A user may permanently exclude themselves from their messages being read and analyzed by using the [p]dontsimulateme command. This will also delete all their data.",
    "hidden": false,
    "install_msg": "🧠 __**Simulator**__```Simulator cog installed. Instructions:\n1. Load it with [p]load simulator\n2. Configure an inputrole, inputchannels, and outputchannel, using [p]simulator set\n3. For testing, load 1 day of past messages with [p]simulator feed 1\n4. Start it with [p]simulator start\n5. You may trigger a simulated conversation manually by typing in the output channel.\n\n⚠ Usage Warning: This cog will store and analyze messages sent by participating users. The bot owner may also choose to let the bot download large amounts of past messages, following Discord ratelimits. It will then store a model in memory whose approximate RAM usage is 60 MB per 100,000 messages analyzed. This data will be stored locally and won't be shared anywhere outside of the target server.\n\nRead [p]simulator info for more information.```",
    "required_cogs": {},
    "requirements": ["aiosqlite"],
    "short": "Simulates messages from your friend group.",
    "tags": ["crab", "fun", "simulator", "markov", "friends"]
}
